# SetRuleEnabled Method (Int32, Boolean) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..SetRuleEnabled Method (Int32, Boolean)
PerformanceAdviser Class See Also
---
Retrieves an enabled/disabled status for the given rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void SetRuleEnabled(
	int index,
	bool enabled
)
```

Visual Basic
---
```text
Public Sub SetRuleEnabled ( _
	index As Integer, _
	enabled As Boolean _
)
```

Visual C++
---
```text
public:
void SetRuleEnabled(
	int index,
	bool enabled
)
```

# ### Parameters
index
    Type: System..::..Int32 The rule index to set enabled/disabled status for.
enabled
    Type: System..::..Boolean True enables the rule, false disables.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The index is outside of acceptable range. |

# See Also
PerformanceAdviser Class
SetRuleEnabled Overload
Autodesk.Revit.DB Namespace